OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/C8051F040.h
/*  Page 0x02 */
__sfr __at 0x88 CPT1CN   ;  /* COMPARATOR 1 CONTROL                          */
__sfr __at 0x89 CPT1MD   ;  /* COMPARATOR 1 CONFIGURATION                    */
__sfr __at 0xBA AMX2CF   ;  /* ADC 2 MUX CONFIGURATION                       */
__sfr __at 0xBB AMX2SL   ;  /* ADC 2 MUX CHANNEL SELECTION                   */
__sfr __at 0xBC ADC2CF   ;  /* ADC 2 CONFIGURATION                           */
__sfr __at 0xBE ADC2     ;  /* ADC 2 DATA                                    */
__sfr __at 0xC4 ADC2GT   ;  /* ADC 2 GREATER-THAN REGISTER                   */
__sfr __at 0xC6 ADC2LT   ;  /* ADC 2 LESS-THAN REGISTER                      */
__sfr __at 0xC8 TMR4CN   ;  /* TIMER 4 CONTROL                               */
__sfr __at 0xC9 TMR4CF   ;  /* TIMER 4 CONFIGURATION                         */
__sfr __at 0xCA RCAP4L   ;  /* TIMER 4 CAPTURE REGISTER - LOW BYTE           */
__sfr __at 0xCB RCAP4H   ;  /* TIMER 4 CAPTURE REGISTER - HIGH BYTE          */
__sfr __at 0xCC TMR4L    ;  /* TIMER 4 - LOW BYTE                            */
__sfr __at 0xCD TMR4H    ;  /* TIMER 4 - HIGH BYTE                           */
__sfr __at 0xE8 ADC2CN   ;  /* ADC 2 CONTROL                                 */

/*  Page 0x03 */
__sfr __at 0x88 CPT2CN   ;  /* COMPARATOR 2 CONTROL                          */
__sfr __at 0x89 CPT2MD   ;  /* COMPARATOR 2 CONFIGURATION                    */

/*  Page 0x0F */
__sfr __at 0x8A OSCICN   ;  /* INTERNAL OSCILLATOR CONTROL                   */
__sfr __at 0x8B OSCICL   ;  /* INTERNAL OSCILLATOR CALIBRATION               */
__sfr __at 0x8C OSCXCN   ;  /* EXTERNAL OSCILLATOR CONTROL                   */
__sfr __at 0x96 SFRPGCN  ;  /* SFR PAGE CONTROL                              */
__sfr __at 0x97 CLKSEL   ;  /* SYSTEM CLOCK SELECT                           */
__sfr __at 0x9C P4MDOUT  ;  /* PORT 4 OUTPUT MODE                            */
__sfr __at 0x9D P5MDOUT  ;  /* PORT 5 OUTPUT MODE                            */
__sfr __at 0x9E P6MDOUT  ;  /* PORT 6 OUTPUT MODE                            */
__sfr __at 0x9F P7MDOUT  ;  /* PORT 7 OUTPUT MODE                            */
__sfr __at 0xA4 P0MDOUT  ;  /* PORT 0 OUTPUT MODE                            */
__sfr __at 0xA5 P1MDOUT  ;  /* PORT 1 OUTPUT MODE                            */
__sfr __at 0xA6 P2MDOUT  ;  /* PORT 2 OUTPUT MODE CONFIGURATION              */
__sfr __at 0xA7 P3MDOUT  ;  /* PORT 3 OUTPUT MODE CONFIGURATION              */
__sfr __at 0xAD P1MDIN   ;  /* PORT 1 INPUT MODE                             */
__sfr __at 0xAE P2MDIN   ;  /* PORT 2 INPUT MODE                             */
__sfr __at 0xAF P3MDIN   ;  /* PORT 3 INPUT MODE                             */
__sfr __at 0xB7 FLACL    ;  /* FLASH ACCESS LIMIT                            */
__sfr __at 0xC8 P4       ;  /* PORT 4                                        */
__sfr __at 0xD8 P5       ;  /* PORT 5                                        */
__sfr __at 0xE1 XBR0     ;  /* CROSSBAR CONFIGURATION REGISTER 0             */
__sfr __at 0xE2 XBR1     ;  /* CROSSBAR CONFIGURATION REGISTER 1             */
__sfr __at 0xE3 XBR2     ;  /* CROSSBAR CONFIGURATION REGISTER 2             */
__sfr __at 0xE4 XBR3     ;  /* CROSSBAR CONFIGURATION REGISTER 3             */
__sfr __at 0xE8 P6       ;  /* PORT 6                                        */
__sfr __at 0xF8 P7       ;  /* PORT 7                                        */

/*
Do NOT use sfr16 for CAN0DAT !
*/

/*  BIT Registers  */

/*  P0  0x80 */
__sbit __at 0x80 P0_0    ;
__sbit __at 0x81 P0_1    ;
__sbit __at 0x82 P0_2    ;
__sbit __at 0x83 P0_3    ;
__sbit __at 0x84 P0_4    ;
__sbit __at 0x85 P0_5    ;
__sbit __at 0x86 P0_6    ;
__sbit __at 0x87 P0_7    ;

/*  TCON  0x88 */
__sbit __at 0x88 IT0     ;  /* EXT. INTERRUPT 0 TYPE                         */
__sbit __at 0x89 IE0     ;  /* EXT. INTERRUPT 0 EDGE FLAG                    */
__sbit __at 0x8A IT1     ;  /* EXT. INTERRUPT 1 TYPE                         */
__sbit __at 0x8B IE1     ;  /* EXT. INTERRUPT 1 EDGE FLAG                    */
__sbit __at 0x8C TR0     ;  /* TIMER 0 ON/OFF CONTROL                        */
__sbit __at 0x8D TF0     ;  /* TIMER 0 OVERFLOW FLAG                         */
__sbit __at 0x8E TR1     ;  /* TIMER 1 ON/OFF CONTROL                        */
__sbit __at 0x8F TF1     ;  /* TIMER 1 OVERFLOW FLAG                         */

/*  CPT0CN  0x88 */
__sbit __at 0x88 CP0HYN0 ;  /* COMPARATOR 0 NEGATIVE HYSTERESIS 0            */
__sbit __at 0x89 CP0HYN1 ;  /* COMPARATOR 0 NEGATIVE HYSTERESIS 1            */
__sbit __at 0x8A CP0HYP0 ;  /* COMPARATOR 0 POSITIVE HYSTERESIS 0            */
__sbit __at 0x8B CP0HYP1 ;  /* COMPARATOR 0 POSITIVE HYSTERESIS 1            */
__sbit __at 0x8C CP0FIF  ;  /* COMPARATOR 0 FALLING EDGE INTERRUPT           */
__sbit __at 0x8D CP0RIF  ;  /* COMPARATOR 0 RISING EDGE INTERRUPT            */
__sbit __at 0x8E CP0OUT  ;  /* COMPARATOR 0 OUTPUT                           */
__sbit __at 0x8F CP0EN   ;  /* COMPARATOR 0 ENABLE                           */

/*  CPT1CN  0x88 */
__sbit __at 0x88 CP1HYN0 ;  /* COMPARATOR 1 NEGATIVE HYSTERESIS 0            */
__sbit __at 0x89 CP1HYN1 ;  /* COMPARATOR 1 NEGATIVE HYSTERESIS 1            */
__sbit __at 0x8A CP1HYP0 ;  /* COMPARATOR 1 POSITIVE HYSTERESIS 0            */
__sbit __at 0x8B CP1HYP1 ;  /* COMPARATOR 1 POSITIVE HYSTERESIS 1            */
__sbit __at 0x8C CP1FIF  ;  /* COMPARATOR 1 FALLING EDGE INTERRUPT           */
__sbit __at 0x8D CP1RIF  ;  /* COMPARATOR 1 RISING EDGE INTERRUPT            */
__sbit __at 0x8E CP1OUT  ;  /* COMPARATOR 1 OUTPUT                           */
__sbit __at 0x8F CP1EN   ;  /* COMPARATOR 1 ENABLE                           */

/*  CPT2CN  0x88 */
__sbit __at 0x88 CP2HYN0 ;  /* COMPARATOR 2 NEGATIVE HYSTERESIS 0            */
__sbit __at 0x89 CP2HYN1 ;  /* COMPARATOR 2 NEGATIVE HYSTERESIS 1            */
__sbit __at 0x8A CP2HYP0 ;  /* COMPARATOR 2 POSITIVE HYSTERESIS 0            */
__sbit __at 0x8B CP2HYP1 ;  /* COMPARATOR 2 POSITIVE HYSTERESIS 1            */
__sbit __at 0x8C CP2FIF  ;  /* COMPARATOR 2 FALLING EDGE INTERRUPT           */
__sbit __at 0x8D CP2RIF  ;  /* COMPARATOR 2 RISING EDGE INTERRUPT            */
__sbit __at 0x8E CP2OUT  ;  /* COMPARATOR 2 OUTPUT                           */
__sbit __at 0x8F CP2EN   ;  /* COMPARATOR 2 ENABLE                           */

