OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/C8051F040.h
/*  ADC2CN  0xE8 */
__sbit __at 0xE8 AD2WINT ;  /* ADC 2 WINDOW INTERRUPT FLAG                   */
__sbit __at 0xE9 AD2CM0  ;  /* ADC 2 CONVERT START MODE BIT 0                */
__sbit __at 0xEA AD2CM1  ;  /* ADC 2 CONVERT START MODE BIT 1                */
__sbit __at 0xEB AD2CM2  ;  /* ADC 2 CONVERT START MODE BIT 2                */
__sbit __at 0xEC AD2BUSY ;  /* ADC 2 BUSY FLAG                               */
__sbit __at 0xED AD2INT  ;  /* ADC 2 EOC INTERRUPT FLAG                      */
__sbit __at 0xEE AD2TM   ;  /* ADC 2 TRACK MODE                              */
__sbit __at 0xEF AD2EN   ;  /* ADC 2 ENABLE                                  */

/*  P6  0xE8 */
__sbit __at 0xE8 P6_0    ;
__sbit __at 0xE9 P6_1    ;
__sbit __at 0xEA P6_2    ;
__sbit __at 0xEB P6_3    ;
__sbit __at 0xEC P6_4    ;
__sbit __at 0xED P6_5    ;
__sbit __at 0xEE P6_6    ;
__sbit __at 0xEF P6_7    ;

/*  SPI0CN  0xF8 */
__sbit __at 0xF8 SPIEN   ;  /* SPI 0 SPI ENABLE                              */
__sbit __at 0xF9 TXBMT   ;  /* SPI 0 TX BUFFER EMPTY FLAG                    */
__sbit __at 0xFA NSSMD0  ;  /* SPI 0 SLAVE SELECT MODE 0                     */
__sbit __at 0xFB NSSMD1  ;  /* SPI 0 SLAVE SELECT MODE 1                     */
__sbit __at 0xFC RXOVRN  ;  /* SPI 0 RX OVERRUN FLAG                         */
__sbit __at 0xFD MODF    ;  /* SPI 0 MODE FAULT FLAG                         */
__sbit __at 0xFE WCOL    ;  /* SPI 0 WRITE COLLISION FLAG                    */
__sbit __at 0xFF SPIF    ;  /* SPI 0 INTERRUPT FLAG                          */

/*  CAN0CN  0xF8 */
__sbit __at 0xF8 CANINIT ;  /* CAN INITIALIZATION                            */
__sbit __at 0xF9 CANIE   ;  /* CAN MODULE INTERRUPT ENABLE                   */
__sbit __at 0xFA CANSIE  ;  /* CAN STATUS CHANGE INTERRUPT ENABLE            */
__sbit __at 0xFB CANEIE  ;  /* CAN ERROR INTERRUPT ENABLE                    */
__sbit __at 0xFC CANIF   ;  /* CAN INTERRUPT FLAG                            */
__sbit __at 0xFD CANDAR  ;  /* CAN DISABLE AUTOMATIC RETRANSMISSION          */
__sbit __at 0xFE CANCCE  ;  /* CAN CONFIGURATION CHANGE ENABLE               */
__sbit __at 0xFF CANTEST ;  /* CAN TEST MODE ENABLE                          */

/*  P7  0xF8 */
__sbit __at 0xF8 P7_0    ;
__sbit __at 0xF9 P7_1    ;
__sbit __at 0xFA P7_2    ;
__sbit __at 0xFB P7_3    ;
__sbit __at 0xFC P7_4    ;
__sbit __at 0xFD P7_5    ;
__sbit __at 0xFE P7_6    ;
__sbit __at 0xFF P7_7    ;


/* Predefined SFR Bit Masks */

#define IDLE              0x01    /* PCON                                */
#define STOP              0x02    /* PCON                                */
#define ECCF              0x01    /* PCA0CPMn                            */
#define PWM               0x02    /* PCA0CPMn                            */
#define TOG               0x04    /* PCA0CPMn                            */
#define MAT               0x08    /* PCA0CPMn                            */
#define CAPN              0x10    /* PCA0CPMn                            */
#define CAPP              0x20    /* PCA0CPMn                            */
#define ECOM              0x40    /* PCA0CPMn                            */
#define PWM16             0x80    /* PCA0CPMn                            */
#define PORSF             0x02    /* RSTSRC                              */
#define SWRSF             0x10    /* RSTSRC                              */


/* SFR PAGE DEFINITIONS */

#define CONFIG_PAGE       0x0F     /* SYSTEM AND PORT CONFIGURATION PAGE */
#define LEGACY_PAGE       0x00     /* LEGACY SFR PAGE                    */
#define TIMER01_PAGE      0x00     /* TIMER 0 AND TIMER 1                */
#define CPT0_PAGE         0x01     /* COMPARATOR 0                       */
#define CPT1_PAGE         0x02     /* COMPARATOR 1                       */
#define CPT2_PAGE         0x03     /* COMPARATOR 2                       */
#define UART0_PAGE        0x00     /* UART 0                             */
#define UART1_PAGE        0x01     /* UART 1                             */
#define SPI0_PAGE         0x00     /* SPI 0                              */
#define EMI0_PAGE         0x00     /* EXTERNAL MEMORY INTERFACE          */
#define ADC0_PAGE         0x00     /* ADC 0                              */
#define ADC2_PAGE         0x02     /* ADC 2                              */
#define SMB0_PAGE         0x00     /* SMBUS 0                            */
#define TMR2_PAGE         0x00     /* TIMER 2                            */
#define TMR3_PAGE         0x01     /* TIMER 3                            */
#define TMR4_PAGE         0x02     /* TIMER 4                            */
#define DAC0_PAGE         0x00     /* DAC 0                              */
#define DAC1_PAGE         0x01     /* DAC 1                              */
#define PCA0_PAGE         0x00     /* PCA 0                              */
#define CAN0_PAGE         0x01     /* CAN 0                              */

#endif
